OODD_1/app/controllers/rooms_controller.rb

  def index
    @rooms = Room.all
---
SELECT "rooms".* FROM "rooms" WHERE (room_size ILIKE '%small%')

  def create
    @room = Room.new(room_params)

    respond_to do |format|
      if @room.save
---
INSERT INTO "rooms" ("room_id", "building", "room_size", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["room_id", 1], ["building", "Hunt Library"], ["room_size", "Small - 4 chairs"], ["created_at", 2016-09-23 00:35:03 UTC], ["updated_at", 2016-09-23 00:35:03 UTC]]

  def update
    respond_to do |format|
      if @room.update(room_params)
---
UPDATE "rooms" SET "room_size" = $1, "updated_at" = $2 WHERE "rooms"."id" = $3  [["room_size", "Medium - 6 chairs"], ["updated_at", 2016-09-23 06:12:56 UTC], ["id", 1]]

  def destroy
    @room.destroy
---
DELETE FROM "rooms" WHERE "rooms"."id" = $1  [["id", 1]]